app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "jet"], ["user_id", 4], ["created_at", "2017-03-12 00:20:42.368357"], ["updated_at", "2017-03-12 00:20:42.368357"]]